app/Controllers/barControlador.php

    public function index()
    {
        $bebidaModelo = new BebidaModelo();
        $data['bebidas'] = $bebidaModelo->findAll();

        // Obtener los tipos de bebida disponibles

        //$tiposBebida = $bebidaModelo->distinct('tipo_id')->findColumn('tipo_id');
        $tipoBebidaModelo = new TipoBebidaModelo();
        $data['tiposBebida'] = $tipoBebidaModelo->findAll();
---
SELECT *
FROM `bebidas`
SELECT *
FROM `tipos_bebida`

    public function buscarBebida()
    {
        $busqueda = $this->request->getPost('busqueda'); // Obtener el valor del campo de búsqueda del formulario

        if (!empty($busqueda)) {
            // Lógica para buscar bebida por nombre
            $bebidaModelo = new BebidaModelo();
            $bebidaEncontrada = $bebidaModelo->like('nombre', $busqueda)->findAll();
---
SELECT *
FROM `bebidas`
WHERE `nombre` LIKE '%COCACOLA%' ESCAPE '!'

    public function filtrarPorTipo($tipo)
{
    // Obtener las bebidas filtradas por tipo
    $bebidaModelo = new BebidaModelo();
    $data['bebidas'] = $bebidaModelo->where('tipo_id', $tipo)->findAll();

    // Obtener los tipos de bebida disponibles
    $tipoBebidaModelo = new TipoBebidaModelo();
    $data['tiposBebida'] = $tipoBebidaModelo->findAll();
---
SELECT *
FROM `bebidas`
WHERE `tipo_id` = '1'
SELECT *
FROM `tipos_bebida`