app/Controllers/barControlador.php

SELECT *
FROM `bebidas`
WHERE `tipo_id` = 'checkout.php'
---
    public function verDetalleOrden($tipo_id)
    {
        // Lógica para ver detalles de una bebida específica
        $bebidaModelo = new BarModelo();  // Cambiado a BarModelo
        $data['bebidaEncontrada'] = $bebidaModelo->where('tipo_id', $tipo_id)->findAll();