app/Models/CarritoModelo.php

    public function agregarAlCarrito($id_carrito, $id_bebida, $cantidad)
{
    $data = [
        'id_carrito' => $id_carrito,
        'id_bebida' => $id_bebida,
        'cantidad' => $cantidad,
    ];

    $this->db->table('carrito_compras')->insert($data);
---
INSERT INTO `carrito_compras` (`id_carrito`, `id_bebida`, `cantidad`) VALUES ('carrito_6536df13a33b8', '3', '1')